{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_constraint": null, "input_length": 71, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "mask_zero": false, "name": "neu_embedding_1", "trainable": false, "embeddings_regularizer": null, "batch_input_shape": [null, 71], "activity_regularizer": null, "output_dim": 300, "input_dim": 7192, "dtype": "float32"}}, {"class_name": "Dropout", "config": {"name": "neu_dropout_1", "rate": 0.25, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "name": "neu_blstm_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "recurrent_constraint": null, "trainable": true, "unroll": false, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "unit_forget_bias": true, "go_backwards": false, "name": "lstm_1", "units": 200, "implementation": 1, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "return_state": false}}}}, {"class_name": "Dropout", "config": {"name": "neu_dropout_2", "rate": 0.25, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "neu_pool_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "sigmoid", "name": "neu_dense_1", "units": 50, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "neu_dropout_3", "rate": 0.25, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "sigmoid", "name": "neu_dense_2", "units": 1, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}}], "keras_version": "2.1.2"}