{"keras_version": "2.1.2", "config": [{"config": {"activity_regularizer": null, "dtype": "float32", "input_length": 71, "embeddings_constraint": null, "output_dim": 300, "input_dim": 7192, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "batch_input_shape": [null, 71], "embeddings_regularizer": null, "name": "embedding_1", "mask_zero": false, "trainable": false}, "class_name": "Embedding"}, {"config": {"name": "dropout_1", "seed": null, "trainable": true, "rate": 0.25, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "bidirectional_1", "layer": {"config": {"implementation": 1, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "units": 200, "kernel_regularizer": null, "stateful": false, "go_backwards": false, "use_bias": true, "return_sequences": true, "unroll": false, "unit_forget_bias": true, "trainable": true, "recurrent_regularizer": null, "activity_regularizer": null, "name": "lstm_1", "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_constraint": null, "activation": "tanh", "bias_regularizer": null, "kernel_constraint": null, "return_state": false}, "class_name": "LSTM"}, "trainable": true, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"name": "dropout_2", "seed": null, "trainable": true, "rate": 0.25, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "global_max_pooling1d_1", "trainable": true}, "class_name": "GlobalMaxPooling1D"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "units": 50, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "seed": null, "trainable": true, "rate": 0.25, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "units": 1, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}