{"keras_version": "2.1.6", "class_name": "Model", "config": {"output_layers": [["dense_18", 0, 0]], "name": "model_12", "input_layers": [["input_6", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "name": "input_6", "batch_input_shape": [null, 98], "dtype": "float32"}, "name": "input_6", "inbound_nodes": []}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_15", "units": 8, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "relu", "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 98], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}, "name": "dense_15", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_16", "units": 4, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}, "name": "dense_16", "inbound_nodes": [[["dense_15", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_17", "units": 8, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}, "name": "dense_17", "inbound_nodes": [[["dense_16", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_18", "units": 98, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "sigmoid", "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}, "name": "dense_18", "inbound_nodes": [[["dense_17", 0, 0, {}]]]}]}, "backend": "tensorflow"}