{"keras_version": "2.1.6", "config": {"name": "model_28", "output_layers": [["dense_28", 0, 0]], "input_layers": [["input_14", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_14", "config": {"dtype": "float32", "batch_input_shape": [null, 98], "name": "input_14", "sparse": false}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense_27", "config": {"trainable": true, "use_bias": true, "units": 4, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": {"config": {"l1": 9.999999747378752e-05, "l2": 0.0}, "class_name": "L1L2"}, "kernel_constraint": null, "activation": "relu", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "name": "dense_27", "batch_input_shape": [null, 98]}, "inbound_nodes": [[["input_14", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_28", "config": {"trainable": true, "use_bias": true, "units": 98, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "sigmoid", "bias_regularizer": null, "bias_constraint": null, "name": "dense_28"}, "inbound_nodes": [[["dense_27", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow"}