{"class_name": "Model", "config": {"name": "model_58", "input_layers": [["input_29", 0, 0]], "output_layers": [["dense_58", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_29", "inbound_nodes": [], "config": {"batch_input_shape": [null, 98], "sparse": false, "name": "input_29", "dtype": "float32"}}, {"class_name": "Dense", "name": "dense_57", "inbound_nodes": [[["input_29", 0, 0, {}]]], "config": {"batch_input_shape": [null, 98], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "dense_57", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "units": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"class_name": "Dense", "name": "dense_58", "inbound_nodes": [[["dense_57", 0, 0, {}]]], "config": {"kernel_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "name": "dense_58", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "units": 98, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}]}, "keras_version": "2.1.6", "backend": "tensorflow"}